#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.vstshop_backend.data.archive_file.lambda_zip: Reading...
module.vstshop_backend.data.archive_file.lambda_zip: Read complete after 0s [id=17e36d819ac8eee0ad9a73d020a2f486c28fe729]
module.vstshop_backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.vstshop_frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.vstshop_backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.vstshop_backend.aws_dynamodb_table.users: Refreshing state... [id=vstshop-users-dev]
module.vstshop_frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.vstshop_auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.vstshop_backend.aws_api_gateway_resource.check_vst: Refreshing state... [id=khqpyv]
module.vstshop_backend.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev]
module.vstshop_backend.aws_lambda_function.vst_checker: Refreshing state... [id=vstshop-vst-checker-dev]
module.vstshop_backend.module.api_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-OPTIONS]
module.vstshop_backend.module.api_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-khqpyv-OPTIONS-200]
module.vstshop_backend.module.api_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-OPTIONS]
module.vstshop_backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev]
module.vstshop_backend.module.api_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-khqpyv-OPTIONS-200]
module.vstshop_auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.vstshop_backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.vstshop_backend.aws_api_gateway_method.check_vst_get: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-GET]
module.vstshop_frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.vstshop_frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.vstshop_backend.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.vstshop_backend.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-GET]
module.vstshop_frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.vstshop_auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.vstshop_backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=7ia3cs]
module.vstshop_backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_V9hhjw2Y5
            VITE_USER_POOL_CLIENT_ID=2p1utd8g6jkts9qp59n7b5k9le
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.vstshop_frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E228GMNSTNHTAD"
        tags                            = {}
        # (24 unchanged attributes hidden)

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>